bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fineDEMfoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4.0;

deltaT          0.0005;

writeControl    runTime;
writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0;

maxAlphaCo      5;

maxDeltaT       1;

functions
{
    // #sinclude   "sampling"
}


// ************************************************************************* //
