bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Channel dimensions
// Length (x) = 1.0 m
// Height (y) = 0.1 m
// Width (z) = 0.1 m

vertices
(
    (0 0 0)             // 0
    (1.0 0 0)           // 1
    (1.0 0.1 0)         // 2
    (0 0.1 0)           // 3
    (0 0 0.1)           // 4
    (1.0 0 0.1)         // 5
    (1.0 0.1 0.1)       // 6
    (0 0.1 0.1)         // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch; // Atmosphere
        faces
        (
            (3 7 6 2)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)   // Back
            (4 5 6 7)   // Front
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
