bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       27900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       28000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       28100;
    }
    top
    {
        type            patch;
        nFaces          1000;
        startFace       29100;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       30100;
    }
)

// ************************************************************************* //
