bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    location "constant";
    object HFDIBDEMDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames (cube);

stepDEM 5e-4; // Larger time step for speed
recordSimulation true;
nSolidsInDomain 1;
surfaceThreshold 0.5;

DEM {
    materials {
        particleMat {
            Y 1e7;
            nu 0.3;
            mu 0.5;
            adhN 0;
            eps 0.8;
        }
    }

    collisionPatches {
        // No collision patches needed for free sedimentation in infinite fluid?
        // Or maybe bottom wall?
        // For now, let's keep it empty or define bottom if needed.
        // The domain is 40cm high, particle starts at 39cm.
        // It will fall.
    }
}

interpolationSchemes {
    method leastSquares;

    leastSquaresCoeffs {
        distFactor 1.5;
        radiusFactor 1.5;
        angleFactor 1.5;
        maxCCRows 20;
    }
}

cube0
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.1 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube1
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.18 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube2
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.26 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube3
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.34 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube4
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.42 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube5
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.50 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube6
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.58 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube7
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.66 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube8
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.74 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

cube9
{
    bodyGeom convex "cube_3mm.stl";
    bodyAddition {
        addModel once;
        position (0.82 0.005 0.05);
        orientation (1 0 0 0 1 0 0 0 1);
    }
    material particleMat;
    rho rho [1 -3 0 0 0 0 0] 2000;
    fullyCoupledBody {}
}

// ************************************************************************* //