bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-05;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform 1.5e-05;
        value           uniform 1.5e-05;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.5e-05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.5e-05;
        value           uniform 1.5e-05;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-05;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-05;
    }
}

// ************************************************************************* //
