bashyal/Applications/srcTestMain/cfd_dem/horizontalChannel/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-05; // Low turbulence intensity

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 3.75e-05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 3.75e-05;
        value           uniform 3.75e-05;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-05;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 3.75e-05;
    }
}

// ************************************************************************* //
